steps.org
#+TITLE: Simulation Results steps
#+AUTHOR: Daniel Moreno Manzano

#+LATEX_HEADER: \usepackage{geometry}
#+LATEX_HEADER: \geometry{left=2.5cm,right=2.5cm,top=2.5cm,bottom=2.5cm}

#+OPTIONS: toc:nil


* First Step

#+caption: Information of the first benchmark used
#+NAME: tab:bench1
#+ATTR_LATEX: :booktabs :environment :width \textwidth :float t :align |c|c|c|
|-----------+----------+---------|
| Benchmark | # qubits | # gates |
|-----------+----------+---------|
| 4gt11_82  |        5 |      27 |
|-----------+----------+---------|

#+caption: Step 1 results
#+NAME: tab:step1
#+ATTR_LATEX: :booktabs :environment :width \textwidth :float t :align |p{2cm}|p{1cm}|p{1cm}|p{1cm}|p{1cm}|p{1cm}|p{2cm}|p{1cm}|
|-------------+-------------+------+------+------------+------------+-----------+-------|
| Mapper      | Init. place |   t1 |   t2 | meas. err. | P. success |       $f$ | $V_Q$ |
|-------------+-------------+------+------+------------+------------+-----------+-------|
| No          | No          | 3500 | 1500 |       0.03 |       0.98 |  0.970122 |   390 |
| minextendrc | No          | 3500 | 1500 |       0.03 |       0.92 | 0.8793333 |  1582 |
| minextendrc | Yes         | 3500 | 1500 |       0.03 |       0.95 |   0.92134 |  1038 |
| minextend   | No          | 3500 | 1500 |       0.03 |       0.97 | 0.9294102 |  1264 |
| minextend   | Yes         | 3500 | 1500 |       0.03 |       0.98 | 0.9502046 |   834 |
|-------------+-------------+------+------+------------+------------+-----------+-------|

#+caption: Other mapper statistics
#+NAME: tab:step1_other
#+ATTR_LATEX: :booktabs :environment :width \textwidth :float t :align |p{2cm}|p{2cm}|p{2cm}|p{2cm}|p{2cm}|
|-------------+-------------+--------------------------+-------+---------|
| Mapper      | Init. place | # qubits (after mapping) | depth | # SWAPS |
|-------------+-------------+--------------------------+-------+---------|
| No          | No          |                        5 |    84 |       0 |
| minextendrc | No          |                        7 |   237 |      17 |
| minextendrc | Yes         |                        6 |   174 |      10 |
| minextend   | No          |                        8 |   228 |      16 |
| minextend   | Yes         |                        6 |   165 |       9 |
|-------------+-------------+--------------------------+-------+---------|
